ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32L40x/N32L402.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>DAC</name>
            <description>digital to analog converter</description>
            <groupName>DAC</groupName>
            <baseAddress>0x40007400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x38</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DAC_CTRL</name>
                    <displayName>DAC_CTRL</displayName>
                    <description>DAC_CTRL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x1fff1fff</resetMask>
                    <fields>
                        <field>
                            <name>CHEN</name>
                            <description>CHEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BEN</name>
                            <description>BEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TEN</name>
                            <description>TEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSEL</name>
                            <description>TSEL</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>WEN</name>
                            <description>WEN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MASEL</name>
                            <description>MASEL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DMAEN</name>
                            <description>DMAEN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAC_SOTTR</name>
                    <displayName>DAC_SOTTR</displayName>
                    <description>DAC_SOTTR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>TR1EN</name>
                            <description>TR1EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAC_DR12CH</name>
                    <displayName>DAC_DR12CH</displayName>
                    <description>DAC_DR12CH</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>DACCHD</name>
                            <description>DACCHD</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAC_DL12CH</name>
                    <displayName>DAC_DL12CH</displayName>
                    <description>DAC_DL12CH</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000fff0</resetMask>
                    <fields>
                        <field>
                            <name>DACCHD</name>
                            <description>DACCHD</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAC_DR8CH</name>
                    <displayName>DAC_DR8CH</displayName>
                    <description>DAC_DR8CH</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>DACCHD</name>
                            <description>DACCHD</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAC_DATO</name>
                    <displayName>DAC_DATO</displayName>
                    <description>DAC_DATO</description>
                    <addressOffset>0x2c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>DACCHDO</name>
                            <description>DACCHDO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
