ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32L40x/N32L402.svd
            </registers>
        </peripheral>

        <peripheral derivedFrom="UART4">
            <name>UART5</name>
            <baseAddress>0x40015400</baseAddress>
            <interrupt>
                <name>UART5</name>
                <description>UART5 global interrupt</description>
                <value>48</value>
            </interrupt>
        </peripheral>

        <peripheral>
            <name>WWDG</name>
            <description>window watchdog</description>
            <groupName>WWDG</groupName>
            <baseAddress>0x40002C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>WWDG</name>
                <description>WWDG interrupt</description>
                <value>0</value>
            </interrupt>			
            <registers>
                <register>
                    <name>WWDG_CTRL</name>
                    <displayName>WWDG_CTRL</displayName>
                    <description>WWDG_CTRL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000007f</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>T</name>
                            <description>T</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ACTB</name>
                            <description>ACTB</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>
                <register>
                    <name>WWDG_CFG</name>
                    <displayName>WWDG_CFG</displayName>
                    <description>WWDG_CFG</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000007f</resetValue>
                    <resetMask>0x000003ff</resetMask>
                    <fields>
                        <field>
                            <name>W</name>
                            <description>W</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>TIMERB</name>
                            <description>TIMERB</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EWINT</name>
                            <description>EWINT</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>
                <register>
                    <name>WWDG_STS</name>
                    <displayName>WWDG_STS</displayName>
                    <description>WWDG_STS</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>EWINTF</name>
                            <description>EWINTF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>	
        </peripheral>

        <peripheral>
            <name>USB</name>
            <description>Universal serial bus full-speed device interface</description>
            <groupName>USB</groupName>
            <baseAddress>0x40005C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>USB_HP</name>
                <description>USB Device High Priority interrupt</description>
                <value>20</value>
            </interrupt>
            <interrupt>
                <name>USB_LP</name>
                <description>USB Device Low Priority interrupt</description>
                <value>21</value>
            </interrupt>
            <interrupt>
                <name>USBWakeUp</name>
                <description>USB Device WakeUp from suspend through EXTI Line interrupt</description>
                <value>42</value>
            </interrupt>
            <registers>
                <register>
                    <name>USB_EP0</name>
                    <displayName>USB_EP0</displayName>
                    <description>USB_EP0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>EPADDR</name>
                            <description>EPADDR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>STS_TX</name>
                            <description>STS_TX</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATTOG_TX</name>
                            <description>DATTOG_TX</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTRS_TX</name>
                            <description>CTRS_TX</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP_KIND</name>
                            <description>EP_KIND</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP_TYPE</name>
                            <description>EP_TYPE</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SETUP</name>
                            <description>SETUP</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STS_RX</name>
                            <description>STS_RX</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATTOG_RX</name>
                            <description>DATTOG_RX</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTRS_RX</name>
                            <description>CTRS_RX</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USB_EP1</name>
                    <displayName>USB_EP1</displayName>
                    <description>USB_EP1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>EPADDR</name>
                            <description>EPADDR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>STS_TX</name>
                            <description>STS_TX</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATTOG_TX</name>
                            <description>DATTOG_TX</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTRS_TX</name>
                            <description>CTRS_TX</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP_KIND</name>
                            <description>EP_KIND</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP_TYPE</name>
                            <description>EP_TYPE</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SETUP</name>
                            <description>SETUP</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STS_RX</name>
                            <description>STS_RX</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATTOG_RX</name>
                            <description>DATTOG_RX</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTRS_RX</name>
                            <description>CTRS_RX</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USB_EP2</name>
                    <displayName>USB_EP2</displayName>
                    <description>USB_EP2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>EPADDR</name>
                            <description>EPADDR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>STS_TX</name>
                            <description>STS_TX</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATTOG_TX</name>
                            <description>DATTOG_TX</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTRS_TX</name>
                            <description>CTRS_TX</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP_KIND</name>
                            <description>EP_KIND</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP_TYPE</name>
                            <description>EP_TYPE</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SETUP</name>
                            <description>SETUP</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STS_RX</name>
                            <description>STS_RX</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATTOG_RX</name>
                            <description>DATTOG_RX</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTRS_RX</name>
                            <description>CTRS_RX</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USB_EP3</name>
                    <displayName>USB_EP3</displayName>
                    <description>USB_EP3</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>EPADDR</name>
                            <description>EPADDR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>STS_TX</name>
                            <description>STS_TX</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATTOG_TX</name>
                            <description>DATTOG_TX</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTRS_TX</name>
                            <description>CTRS_TX</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP_KIND</name>
                            <description>EP_KIND</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP_TYPE</name>
                            <description>EP_TYPE</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SETUP</name>
                            <description>SETUP</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STS_RX</name>
                            <description>STS_RX</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATTOG_RX</name>
                            <description>DATTOG_RX</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTRS_RX</name>
                            <description>CTRS_RX</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USB_EP4</name>
                    <displayName>USB_EP4</displayName>
                    <description>USB_EP4</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>EPADDR</name>
                            <description>EPADDR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>STS_TX</name>
                            <description>STS_TX</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATTOG_TX</name>
                            <description>DATTOG_TX</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTRS_TX</name>
                            <description>CTRS_TX</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP_KIND</name>
                            <description>EP_KIND</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EP_TYPE</name>
                            <description>EP_TYPE</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SETUP</name>
                            <description>SETUP</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STS_RX</name>
                            <description>STS_RX</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATTOG_RX</name>
                            <description>DATTOG_RX</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTRS_RX</name>
                            <description>CTRS_RX</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
